package Task;

public class Circle extends Figure {
    // TODO: DK: поля класса обычно не делают public. Их обычно объявляют private, а доступ организовывают через геттеры и сеттеры.
    public int radius;

    // TODO: DK: Конструктор по умолчанию не обязательно должен присутствовать в классе. В данном случае он не имеет практического смысла. Вряд липонадобиться создавать круг безрадиуса.
    // TODO: DK: Его например можно было бы использовать если бы ты создавал круг со случайным значением радиуса.
    public Circle() {

    }
    public Circle(int r) {
        /**  TODO: DK: this обязательно писать в случаях если имя поля и имя параметра совпадают.
         *
         * В дугих моментах его можно опускать.
         * В твоём случае у тебя "r" и "radius". Можно просто писать "radius=r"
         *
         * Использование this - это не ошибка, с ним тоже все верно. Просто для краткости и иногда для удобства чтения его лучше опускать.
         *
         */
        this.radius = r;
    }

    public void findSquare() {
        // TODO: DK: то жесамое с this - можно не писать.

        // TODO: DK: Для математических операций есть класс java.lang.Math, в нем есть значение костанты ПИ -  Math.PI
        this.square = 3.14 * this.radius * this.radius;
    }

}

