// TODO: DK: Имя пакета принято начинать с домена компании "com.epam", также обычно пакеты называют маленькими буквами.
package Task;

public abstract class Figure {
    // TODO: DK: поля класса обычно не делают public. Их обычно объявляют private, а доступ организовывают через геттеры и сеттеры.
    // TODO: DK: значение площади - это вычисляемая велечина, возможно нет смысла хранить его как поле класса.
    public double square;


    // TODO: DK: Мне кажется лучше сделать этот метод не "void", а возвращать из него double - значение площади.
    public abstract void findSquare();

}
